jhirsi/sdk-nrf/drivers/dect_nrp/nrf91_mac/dect_nrf91_ctrl_internal.h
/*
 * Copyright (c) 2025 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/**
 * @file dect_nrf91_ctrl_internal.h
 * @brief Internal definitions for DECT NR+ Control Module
 *
 * @details
 * This header file is for internal use only within the control module files:
 * - dect_nrf91_ctrl.c
 * - dect_nrf91_ctrl_mdm.c
 * - dect_nrf91_ctrl_api.c
 *
 * Do not include this header in other modules.
 */

#ifndef DECT_NRF91_CTRL_INTERNAL_H
#define DECT_NRF91_CTRL_INTERNAL_H

#include <zephyr/kernel.h>
#include <stdint.h>
#include <stddef.h>
#include <zephyr/net/net_if.h>

#include <nrf_modem_dect_mac.h>
#include <dect_net_l2_mgmt.h>
#include <dect_net_l2.h>

#include "dect_nrf91_common.h"
#include "dect_nrf91_ctrl.h"

/* Internal message queue operations enum */
typedef enum {
	DECT_NRF91_CTRL_OP_MDM_CAPABILITIES,
	DECT_NRF91_CTRL_OP_MDM_CONFIGURE_RESP,
	DECT_NRF91_CTRL_OP_MDM_CFUN_RESP,
	DECT_NRF91_CTRL_OP_MDM_ACTIVATED,
	DECT_NRF91_CTRL_OP_MDM_DEACTIVATED,
	DECT_NRF91_CTRL_OP_AUTO_START,
	DECT_NRF91_CTRL_OP_CLUSTER_START_REQ,
	DECT_NRF91_CTRL_OP_CLUSTER_RECONFIG_REQ,
	DECT_NRF91_CTRL_OP_CLUSTER_IPV6_PREFIX_CHANGE_RECONFIG_REQ,
	DECT_NRF91_CTRL_OP_CLUSTER_CONFIG_RESP,
	DECT_NRF91_CTRL_OP_CLUSTER_CH_LOAD_CHANGED,
	DECT_NRF91_CTRL_OP_NEIGHBOR_INACTIVITY,
	DECT_NRF91_CTRL_OP_RSSI_START_REQ_CMD,
	DECT_NRF91_CTRL_OP_RSSI_START_REQ_CH_SELECTION,
	DECT_NRF91_CTRL_OP_MDM_RSSI_RESULT,
	DECT_NRF91_CTRL_OP_MDM_RSSI_COMPLETE,
	DECT_NRF91_CTRL_OP_MDM_RSSI_STOPPED,
	DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START,
	DECT_NRF91_CTRL_OP_MDM_NW_BEACON_START_OR_STOP_DONE,
	DECT_NRF91_CTRL_OP_MDM_NW_BEACON_STOP,
	DECT_NRF91_CTRL_OP_MDM_NW_SCAN_COMPLETE,
	DECT_NRF91_CTRL_OP_MDM_NW_SCAN_STOPPED,
	DECT_NRF91_CTRL_OP_MDM_CLUSTER_BEACON_RCVD,
	DECT_NRF91_CTRL_OP_MDM_NW_BEACON_RCVD,
	DECT_NRF91_CTRL_OP_MDM_CLUSTER_RCV_COMPLETE,
	DECT_NRF91_CTRL_OP_MDM_CLUSTER_INFO,
	DECT_NRF91_CTRL_OP_CLUSTER_BEACON_RX_FAILURE,
	DECT_NRF91_CTRL_OP_NEIGHBOR_PAGING_FAILURE,
	DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_INFO,
	DECT_NRF91_CTRL_OP_MDM_NEIGHBOR_LIST,
	DECT_NRF91_CTRL_OP_MDM_FLOW_CONTROL,
	DECT_NRF91_CTRL_OP_MDM_DLC_DATA_RESP,
	DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_IND,
	DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RESP,
	DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_IND,
	DECT_NRF91_CTRL_OP_MDM_ASSOCIATION_RELEASE_RESP,
	DECT_NRF91_CTRL_OP_MDM_IPV6_CONFIG_CHANGED,
} dect_nrf91_ctrl_op_t;

/* Internal state enums */
typedef enum {
	CTRL_PT_ASSOCIATION_STATE_NONE,
	CTRL_PT_ASSOCIATION_STATE_CLUSTER_FOUND,
	CTRL_PT_ASSOCIATION_STATE_CLUSTER_BEACON_RECEIVED,
	CTRL_PT_ASSOCIATION_STATE_ASSOCIATED,
} ctrl_pt_association_state_t;

typedef enum {
	CTRL_FT_CLUSTER_STATE_NONE = 0,
	CTRL_FT_CLUSTER_STATE_STARTING,
	CTRL_FT_CLUSTER_STATE_STARTED,
} ctrl_ft_cluster_state_t;

typedef enum {
	CTRL_FT_NW_BEACON_STATE_NONE = 0,
	CTRL_FT_NW_BEACON_STATE_STARTING,
	CTRL_FT_NW_BEACON_STATE_STARTED,
	CTRL_FT_NW_BEACON_STATE_STOPPING,
} ctrl_ft_nw_beacon_state_t;

typedef enum {
	CTRL_FT_NETWORK_STATE_NONE = 0,
	CTRL_FT_NETWORK_STATE_STARTING,
	CTRL_FT_NETWORK_STATE_CREATED,
} ctrl_ft_network_state_t;

typedef enum {
	CTRL_MDM_DEACTIVATED = 0,
	CTRL_MDM_ACTIVATE_REQ,
	CTRL_MDM_ACTIVATED,
	CTRL_MDM_DEACTIVATE_REQ,
	CTRL_MDM_REACTIVATING_DEACTIVATE,
	CTRL_MDM_REACTIVATING_CONFIGURE,
} ctrl_mdm_activation_state_t;

/* Internal structures */
struct dect_mac_common_op_event_msgq_item {
	dect_nrf91_ctrl_op_t id;
	void *data;
};

/* Internal structures definitions */
struct dect_nrf91_ctrl_rssi_scan_result_data {
	uint16_t channel;
	bool another_cluster_detected_in_channel;
	bool all_subslots_free;
	uint8_t busy_percentage;
	bool busy_percentage_ok;
	bool scan_suitable_percent_ok;
	uint8_t possible_subslot_cnt;
	uint8_t busy_subslot_cnt;
};

#define DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS 30

struct dect_nrf91_ctrl_rssi_scan_data {
	bool cmd_on_going; /* actual RSSI command */
	uint8_t current_results_index;
	struct dect_nrf91_ctrl_rssi_scan_result_data results[
		DECT_NRF91_CTRL_RSSI_SCAN_RESULTS_MAX_CHANNELS];
};

#define DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS 30

struct dect_nrf91_ctrl_cluster_channel_list_item {
	uint32_t long_rd_id;
	uint16_t channel;
	int8_t rssi_2;
};

struct dect_nrf91_ctrl_scan_data {
	bool on_going;
	struct dect_nrf91_ctrl_cluster_channel_list_item
		cluster_channels[DECT_NRF91_CTRL_CLUSTER_SCAN_DATA_MAX_CHANNELS];
	uint8_t current_cluster_channel_index;
	dect_scan_result_cb_t scan_result_cb;
	struct nrf_modem_dect_mac_network_scan_params scan_params;
};

struct dect_nrf91_ctrl_dlc_data_tx_info {
	uint32_t transaction_id;
	uint32_t data_len;
	bool req_on_going;
};

typedef struct {
	bool debug;
	bool power_save;
	bool auto_start;
	bool auto_activate;
	int8_t tx_pwr;
	uint8_t tx_mcs;
	uint8_t band;
	uint8_t band_group_index;
	uint16_t channel;
	uint32_t long_rd_id;
	uint32_t network_id;
} dect_nrf91_ctrl_configure_params_t;

typedef struct {
	ctrl_pt_association_state_t pt_association_state;
	uint32_t parent_long_rd_id;
	uint32_t network_id;
	uint16_t channel;
} ctrl_pt_association_config_t;

/* Main control data structure - full definition needed for API access */
struct dect_nrf91_ctrl_data {
	bool debug;
	struct nrf_modem_dect_mac_capability_ntf_cb_params mdm_capas;
	ctrl_ft_cluster_state_t ft_cluster_state;
	ctrl_ft_network_state_t ft_network_state;
	ctrl_ft_nw_beacon_state_t ft_nw_beacon_state;
	uint16_t ft_requested_cluster_channel;
	uint16_t ft_cluster_reconfig_prev_cluster_channel;
	struct dect_cluster_reconfig_req_params ft_cluster_reconfig_params;
	bool ft_cluster_reconfig_ongoing;
	ctrl_mdm_activation_state_t mdm_activation_state;
	ctrl_pt_association_config_t ass_config;
	enum nrf_modem_dect_mac_release_cause last_rel_cause;
	struct dect_nrf91_ctrl_rssi_scan_data rssi_scan_data;
	struct dect_nrf91_ctrl_scan_data scan_data;
	dect_nrf91_ctrl_configure_params_t configure_params;
	bool tx_mdm_flow_ctrl_on;
#if defined(CONFIG_DECT_NRP_MAC_NRF_TX_FLOW_CTRL_BASED_ON_MDM_TX_DLC_REQS)
	uint32_t total_unacked_tx_data_amount;
	uint16_t total_unacked_req_amount;
	struct dect_nrf91_ctrl_dlc_data_tx_info
		dlc_data_tx_infos[DECT_NRF91_DLC_DATA_INFO_MAX_COUNT];
#endif
	struct net_if *iface;
};

/* Event structures used for message queue communication */
struct dect_nrf91_ctrl_rssi_measurement_data_evt {
	struct nrf_modem_dect_mac_rssi_result rssi_result;
};

#define DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT 50
struct dect_nrf91_ctrl_neighbor_list_resp_evt {
	int status;
	uint8_t num_neighbors;
	uint32_t neighbor_long_rd_ids[DECT_NRF91_MAX_NEIGHBOR_LIST_COUNT];
};

struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item {
	uint32_t transaction_id;
};

struct dect_nrf91_ctrl_dlc_data_tx_resp_evt {
	enum nrf_modem_dect_mac_err status;
	uint8_t flow_id;
	uint32_t long_rd_id;

	uint8_t num_acked_data;
#if defined(CONFIG_DECT_NRP_MAC_MDM_BUNDLED_TX_RESPS)
	struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item
		acked_data[DECT_NRF91_DLC_DATA_INFO_MAX_COUNT];
#else
	struct dect_nrf91_ctrl_dlc_data_tx_evt_data_item acked_data[1];
#endif
};

/* External mutex and semaphores (defined in dect_nrf91_ctrl.c) */
extern struct k_mutex dect_mac_ctrl_data_mtx;
extern struct k_sem dect_mac_ctrl_reactivate_sema;
extern struct k_sem dect_mac_libmodem_api_sema;

/* External control data (defined in dect_nrf91_ctrl.c) */
extern struct dect_nrf91_ctrl_data ctrl_data;

/* Helper macros for ctrl_data mutex access */
#define CTRL_DATA_LOCK()   k_mutex_lock(&dect_mac_ctrl_data_mtx, K_FOREVER)
#define CTRL_DATA_UNLOCK() k_mutex_unlock(&dect_mac_ctrl_data_mtx)

/* Strategic getters for most commonly accessed single fields */
ctrl_mdm_activation_state_t dect_nrf91_ctrl_get_mdm_activation_state(void);
ctrl_ft_cluster_state_t dect_nrf91_ctrl_get_ft_cluster_state(void);
ctrl_ft_nw_beacon_state_t dect_nrf91_ctrl_get_ft_nw_beacon_state(void);
ctrl_pt_association_state_t dect_nrf91_ctrl_get_pt_association_state(void);

/* Internal function declarations for message queue operations */
int dect_nrf91_ctrl_internal_msgq_data_op_add(
	dect_nrf91_ctrl_op_t event_id, void *data, size_t data_size);
int dect_nrf91_ctrl_internal_msgq_non_data_op_add(dect_nrf91_ctrl_op_t event_id);

/* Internal function to get control data reference (for API layer) */
struct dect_nrf91_ctrl_data *dect_nrf91_ctrl_internal_data_get(void);

/* Internal helper functions */
int dect_nrf91_ctrl_internal_modem_configure_req_from_settings(void);
int dect_nrf91_ctrl_internal_mdm_deactivate_req(void);
bool dect_nrf91_ctrl_internal_nw_beacon_common_can_be_started(uint16_t channel);
int dect_nrf91_ctrl_internal_init(struct net_if *iface);

#endif /* DECT_NRF91_CTRL_INTERNAL_H */

